Today, I spent the time working on this plan in the Splunk BOTS v2.  I am having to do a lot of research again on this one.  I am defintatly learning a lot.  Some of the questions 
that I am stuck on,  I am finding that I need Splunk Enterprise Security.  I only have Security Essentials.  I can not find the dashboards that I need.  I will have to research 
what I can do more. This is what I have so far.

Boss Of The SOC v2 - SIEM Case Investigation
Platform : https://cyberdefenders.org/

I skipped v1 since it looks the same as the one that I did for tryhackme.

In this hands-on exercise, you assume the persona of Alice Bluebird, the analyst who successfully assisted Wayne Enterprises and was recommended to Grace Hoppy at Frothly to assist them with their recent issues.

Hunting Scenarios:

PowerShell: Adversaries will use PowerShell Empire to establish a foothold and carry out attacks.
Exfiltration Over Alternative Protocol - FTP: Data Exfiltration may occur using common network protocols, principally FTP
Exfiltration Over Alternative Protocol - DNS: Data Exfiltration may occur using common network protocols, specifically DNS
Adversary Infrastructure: The adversary has established multiple components of infrastructure beyond what we have already uncovered.
Spearphishing Attachment: Adversaries will attempt to establish a foothold within Froth.ly using Phishing.
User Execution: Adversaries will attempt to establish a foothold within Froth.ly by enticing a user to execute an action on a file.
Persistence - Create Account: An adversary will look to maintain persistence across an enterprise by creating user accounts.
Persistence - Scheduled Task: An adversary will look to maintain persistence across reboots by using a task scheduler.
Indicator Removal On Host: Clearing of audit / event logs could indicate an adversary attempting to cover their tracks.
Reconaissance: User Agent Strings may provide insight into an adversary that they may not have intended to show.
OSINT: Identifying publicly available company information and who is accessing it may provide insight into the adversary.
Lateral Movement: Adversaries will look to move laterally to other systems using Windows Management Instrumentation (WMI).
Data Staging: Adversaries will stage data prior to exfiltration to make it easier to extract data at a time of their choosing as well as have a central place to place information as it is identified.

==============================================================================================================================
bots2.ova file was downloaded and used 

===============================================================================================================================	
1	This is a simple question to get you familiar with submitting answers. What is the name of the company that makes the software that you are using for this competition? Answer guidance: A six-letter word with no punctuation.
A: Splunk
===============================================================================================================================	
2. Amber Turing was hoping for Frothly to be acquired by a potential competitor which fell through, but visited their website to find contact information for their executive team. What is the website domain that she visited? Answer guidance: Do not provide the FQDN. Answer example: google.com

First thing I did was search for a user with "amber" in the name

	user=*amber*

I noticed that 10.0.2.101 has the bulk (83%) of src_ip and is the only client_IP, so I'll try that with a sourcetype of http:stream.  Since she was looking for a competeitor's website. It would be a .com so I add that in the search as well.

	src_ip="10.0.2.101" sourcetype="stream:http" site=*.com

77 sites, I glanced through quickly and see 2 potential answer (berkbeer.com and finnegan.com).
Both are just image links but Berk Beer does have ceoberk.png and may have info on the executive team
---------------
A: berkbeer.com
===============================================================================================================================	
3. Amber found the executive contact information and sent him an email. What is the CEO's name? Provide the first and last name.

I searched berkbeer from sourcetype="stream:smtp

	sourcetype="stream:smtp" berkbeer

2 berkbeer emails showed up (hbernhard@berkbeer.com and mberk@berkbeer.com).

I searched the earliest email with the content_transfer_encoding printable and the first was this:

Mr. Bernhard,
   I was very sorry to hear about the acquisition falling through. I was ve=
ry excited to work with you in the future. I have to admit, I am a little w=
orried about my future here. I'd love to talk to you about some information=
 I have regarding my work.

Amber Turing
Principal Scientist
867.322.1123
Froth.ly
	
	sourcetype="stream:smtp" berkbeer "content_transfer_encoding{}"="quoted-printable" 
	|  reverse
	
His response gave his last name in the email
---------------
A: Martin Berk
===============================================================================================================================	
4. After the initial contact with the CEO, Amber contacted another employee at this competitor. What is that employee's email address?

this was found in my research for the last question.
---------------
A: hbernhard@berkbeer.com
===============================================================================================================================	
5. What is the name of the file attachment that Amber sent to a contact at the competitor?

I brought up all the berkbeer emails again and found 1 file in attach_filename" field
	
	sourcetype="stream:smtp" berkbeer
---------------
A: Saccharomyces_cerevisiae_patent.docx
===============================================================================================================================	
6. What is Amber's personal email address?	

Since the 3 emails that I could read did not have her email,  I checked the encoded one and found her email in the meassage when I decoded with base64decode.org
---------------
A: ambersthebest@yeastiebeastie.com
===============================================================================================================================	
7. What version of TOR did Amber install to obfuscate her web browsing? Answer guidance: Numeric with one or more delimiter.

Knowing that its installed one time than used, I simply searched tor.exe

	tor.exe

I then looked at the process_name field and there it was

---------------	
A:7.0.4
===============================================================================================================================	
8. What is the public IPv4 address of the server running www.brewertalk.com?
This one is an easy search

	dest="www.brewertalk.com"

Now I take a look at dest_ip and 2 are there but 1 is private, 
---------------	
A:52.42.208.228
===============================================================================================================================
===============================================================================================================================	
9. Provide the IP address of the system used to run a web vulnerability scan against www.brewertalk.com.

First thing I looked for was the user agent I searched "brewertalk.com" when I search and I found a few odd ones but no scanners listed

	brewertalk.com

There are a high number of 404 though in the 'http_comment section' So I will add that to the search  I want to take a look at the counts and what was tried so I run stats on my search

	brewertalk.com http_comment="HTTP/1.1 404 Not Found" 
	| stats count by url

4009 differnt urls tried all beginning with (http://www.brewertalk.com/)

8050 of them coming from 45.77.65.211 while the other 2 src_ip combine a total of 9
---------------	
A: 45.77.65.211
===============================================================================================================================	
10. The IP address from question 9 is also being used by a likely different piece of software to attack a URI path. What is the URI path? Answer guidance: Include the leading forward slash in your answer. Do not include the query string or other parts of the URI. Answer example: /phpinfo.php	

I will search the source IP.
	
	src_ip="45.77.65.211"

In the URL field,  I see 1188 alerts for http://www.brewertalk.com/member.php.  That seems like it might be an attack.  So Im going to add that to the search with regex and put results of possible attack in a table to verify.


	src_ip="45.77.65.211" url="http://www.brewertalk.com/member.php" 
	| rex field=src_content "password=(?P<attackpass>.+)&url" 
	| rex field=src_content "username=(?P<attackuser>.+)"
	| table attackpass attackuser 

There is a lot (1188, lets break it down more for user: admin

	src_ip="45.77.65.211" url="http://www.brewertalk.com/member.php" 
	| rex field=src_content "password=(?P<attackpass>.+)&url" 
	| rex field=src_content "username=(?P<attackuser>.+)"
	| table attackpass attackuser 
	| where attackuser= "admin"

520 attempts. 
1 URI Path listed.

---------------
A: member.php
===============================================================================================================================	
11. What SQL function is being abused on the uri path from question 10?	

Before I narrowed the last question by admin, I saw something that may have been SQL_Injection.  So I will bring that back up and click on one of those events.
in one of the user fields I saw:

<dt>SQL Error:</dt>
<dd>1105 - XPATH syntax error: ':23'</dd>

There are 2 functions that provide basic XPATH capabilities (ExtraValue & UpdateXML).

The line "WHERE q.active='1' AND s.sid='makman' and updatexml(NULL,concat (0x3a,(LENGTH((SELECT email FROM mybb_users ORDER BY UID LIMIT 0,1)))),NULL) and '1'",
alets me to a injection using XPATH updateXML injections (updatexml(NULL,concat (0x3a) 

---------------
A:updateXML
===============================================================================================================================	
12. What is Frank Ester's password salt value on www.brewertalk.com?	

I developed a Regex to find what data was exfiltrated.
I am now looking in attack data for frank.

	src_ip "45.77.65.211" uri_path="/member.php" dest_ip="172.31.4.249" sourcetype="stream:http" eventtype=err0r  | rex field=dest_content "XPATH syntax error: ':(?P<attackdata>.+)'.+\R.+\R.+\R.+\R.+\R.+\R.+(SELECT )(?P<attacklabel>.+) F(.+)"
	| stats count by attackdata
	| where attackdata="frank"

I will now add 5 seconds to the 1 event that I found and run it after removing the "where" statement.  I will create a table for timestamp, attacklabel and attackdata.

src_ip "45.77.65.211" uri_path="/member.php" dest_ip="172.31.4.249" sourcetype="stream:http" eventtype=err0r  | rex field=dest_content "XPATH syntax error: ':(?P<attackdata>.+)'.+\R.+\R.+\R.+\R.+\R.+\R.+(SELECT )(?P<attacklabel>.+) F(.+)" | table timestamp attacklabel attackdata

---------------
A:gGsxysZL
===============================================================================================================================	
13. What is user btun's password on brewertalk.com?	
So with this one, I will look for the substring and salt for btun.  I run Regex to get a table of the time, what type of data a exfiltrated and what it was.

btun was exfiltrated at 2017-08-16T15:25:01.312344Z, so I will do a range  of 2017-08-16T15:25:01.312344Z -  2017-08-16T15:25:05.312344Z

	src_ip "45.77.65.211" uri_path="/member.php" dest_ip="172.31.4.249" sourcetype="stream:http" eventtype=err0r 
	| rex field=dest_content "XPATH syntax error: ':(?P<attackdata>.+)'.+\R.+\R.+\R.+\R.+\R.+\R.+(SELECT )(?P<attacklabel>.+) F(.+)"
	| table timestamp attacklabel attackdata

2017-08-16T15:25:04.212702Z	password	4
2017-08-16T15:25:03.810694Z	password	f91904c1dd2723d5911eeba409cc0d1
2017-08-16T15:25:03.412545Z	password	32
2017-08-16T15:25:02.977892Z	salt	tlX7cQPE
2017-08-16T15:25:02.567188Z	salt	8
2017-08-16T15:25:02.146767Z	email	btun@froth.ly
2017-08-16T15:25:01.714926Z	email	13
2017-08-16T15:25:01.312344Z	username	btun

It looks like "4" was cut off the password

f91904c1dd2723d5911eeba409cc0d1 128 bit = MD5
I have to bruteforce f91904c1dd2723d5911eeba409cc0d14

NO list worked yet for me still trying
---------------
A:
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
===============================================================================================================================	
14. What are the characters displayed by the XSS probe? Answer guidance: Submit answer in native language or character set.	

First I want to look for a script in a URI_query (info put in the form)

	sourcetype=stream:http uri_query=*"<script>"*

5 total events, 3 repeated, for easy of parsing.  I will use dedup to elimate copies and view the info I want in a table.

	sourcetype=stream:http uri_query=*"<script>"*
	| dedup uri_query
	| table uri_query

They look encoded in URL,  I found that Splunk has a URLdecoder, so I am going to use it.

	sourcetype=stream:http uri_query=*"<script>"*
	| dedup uri_query
	| eval decode=urldecode(uri_query)
	| table decode

"Submit answer in native language or character set." 
This leads me to think that the characters are not ASCII and one response has that (action=activate&uid=-1&code="><script>alert('대동')</script>)
	 
---------------
A:대동
===============================================================================================================================	
15. What was the value of the cookie that Kevin's browser transmitted to the malicious URL as part of a XSS attack? Answer guidance: All digits. Not the cookie name or symbols like an equal sign.	
I dont remember coming accross Kevin.  So I will just add his name to a query  with the query of the XSS attack.

	sourcetype=stream:http uri_query=*"<script>"* kevin

1 event

So I will look at the cookie.  There are 2 cookie values (mybb[lastvisit]=1502408189; mybb[lastactive]=1502408191)

While researching the 2 values I found:

mybb[lastvisit]
This cookie stores the last time of visit in the UNIX timestamp format.
mybb[lastactive]
This cookie stores the last time that a forum page has been loaded, in the UNIX timestamp format.

I will go with the last visit
---------------
A: 1502408189
===============================================================================================================================	
16. The brewertalk.com web site employed Cross Site Request Forgery (CSRF) techniques. What was the value of the anti-CSRF token that was stolen from Kevin Lagerfield's computer and used to help create an unauthorized admin user on brewertalk.com?	

The anti-CSRF token is a hidden field,  the last answer only had one response (and it was the attack on Kevin), so I will look for the word "hidden"

I find "<input type="hidden" name="my_post_key" value="1bc3eab741900ab25c98eee86bf20feb""
---------------
A: 1bc3eab741900ab25c98eee86bf20fe
===============================================================================================================================	
17. What brewertalk.com username was maliciously created by a spearphishing attack?	
First I want to look to see if there was a created account

	index=botsv2 eventtype=*create*

4 events show up

---------------
A: 
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
===============================================================================================================================	
18. According to Frothly's records, what is the likely MAC address of Mallory's corporate MacBook? Answer guidance: Her corporate MacBook has the hostname MACLORY-AIR13.	
First I search for Mallory and get stats.


	Mallory
	| stats count by user

2 users for mallory come up (mallorykraeuse OR mallory.kraeusen)
I search both of them

	user="mallory.kraeusen" OR "mallorykraeuse"

Now I will look at host and see 3 (MACLORY-AIR3, venus and mercury) 

Since it is a MAC and I know they go by air, 

---------------
A:
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
===============================================================================================================================	
19. What episode of Game of Thrones is Mallory excited to watch? Answer guidance: Submit the HBO title of the episode.	

I first tried searching Mallory's host and download this was no help.

Since people use torrents to download shows and movies, I searched torrent with her host

	host=MACLORY-AIR13 torrent

I went to create regex to pull the name of the torrents out but the first one had it

  target_path":"\/Users\/mallorykraeusen\/Downloads\/GoT.S7E2.BOTS.BOTS.BOTS.mkv.torrent

So I google searched Game Of Throne Season 7 Episode 2
---------------
A: Stormborn
===============================================================================================================================	
20. What is Mallory Krauesen's phone number? Answer guidance: ddd-ddd-dddd where d=[0-9]. No country code.	

---------------
A: 
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
===============================================================================================================================	
21. Enterprise Security contains a threat list notable event for MACLORY-AIR13 and suspect IP address 5.39.93.112. What is the name of the threatlist (i.e. Threat Group) that is triggering the notable?	

---------------
A:
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
===============================================================================================================================	
22. Considering the threatlist you found in the question above, and related data, what protocol often used for file transfer is actually responsible for the generated traffic?	

I searched Mallory's hostname and the IP with no results.

	host=MACLORY-AIR13 5.39.93.112

So now I just search the IP

5.39.93.112

63 events but they all are under the same app: bittorrent 
---------------
A:bittorrent
===============================================================================================================================	
23. Mallory's critical PowerPoint presentation on her MacBook gets encrypted by ransomware on August 18. At what hour, minute, and second does this actually happen? Answer guidance: Provide the time in PDT. Use the 24h format HH:MM:SS, using leading zeroes if needed. Do not use Splunk's _time (index time).	

I search the date and also looked up the powerpoint extension (.pptx)

	date_month=august date_mday=18 	.pptx

"columns.action" field has 1 "CREATED" and the document is "Frothly_marketing_campaign_Q317.pptx.crypt"

The Unix Timestamp on this is 1503093043, this = Friday, August 18, 2017 9:50:43 PM (UTC)

The Unix time for columns.ctime is 1503093022 , this = Friday, August 18, 2017 9:50:22 PM (UTC)
14:50:22

I may be wrong but I am thinking that ctime is the time the process began.  I will have to research this some more to see if I'm correct,  The research that  did so far was inconclusive.
---------------
A: 14:50:22
